{
  "common": {
    "name": "deconz",
    "version": "1.3.21",
    "news": {
      "1.3.21": {
        "en": "added schedule to object definition\nchanged limit for duration to 999999",
        "de": "Zeitplan zur Objektdefinition hinzugefügt\nLimit für die Dauer auf 999999 geändert",
        "ru": "добавлено расписание в определение объекта\nизменен лимит продолжительности на 999999",
        "pt": "agendamento adicionado à definição do objeto\nlimite de duração alterado para 999999",
        "nl": "schema toegevoegd aan objectdefinitie\nlimiet voor duur gewijzigd in 999999",
        "fr": "calendrier ajouté à la définition d'objet\nmodification de la limite de durée à 999999",
        "it": "aggiunta pianificazione alla definizione dell'oggetto\nmodificato il limite di durata a 999999",
        "es": "programación agregada a la definición de objeto\nlímite cambiado para la duración a 999999",
        "pl": "dodano harmonogram do definicji obiektu\nzmieniono limit czasu trwania na 999999",
        "zh-cn": "将计划添加到对象定义\n将持续时间限制更改为 999999"
      },
      "1.3.20": {
        "en": "add retry if gateway is busy\nchange min/max range for offset\nupdated translations\nfix link for overview page\nfix parameter can not be set since deConz 2.11.5\nfix xy is invalid: #289 #295\nremove Sentry",
        "de": "Fügen Sie einen Wiederholungsversuch hinzu, wenn das Gateway beschäftigt ist\nMin/Max-Bereich für Offset ändern\naktualisierte Übersetzungen\nFix Link für Übersichtsseite\nfix Parameter kann seit deConz 2.11.5 nicht gesetzt werden\nFix xy ist ungültig: #289 #295\nSentry entfernen",
        "ru": "добавить повтор, если шлюз занят\nизменить мин./макс. диапазон для смещения\nобновленные переводы\nисправить ссылку на обзорную страницу\nпараметр fix не может быть установлен, начиная с deConz 2.11.5\nисправить xy недопустимо: # 289 # 295\nудалить часового",
        "pt": "adicionar nova tentativa se o gateway estiver ocupado\nalterar intervalo mínimo/máximo para deslocamento\ntraduções atualizadas\ncorrigir link para página de visão geral\nparâmetro fix não pode ser definido desde deConz 2.11.5\ncorreção xy é inválida: #289 #295\nremover Sentinela",
        "nl": "voeg opnieuw toe als gateway bezet is\nverander min/max bereik voor offset\nbijgewerkte vertalingen\nfix link voor overzichtspagina\nfix parameter kan niet worden ingesteld sinds deConz 2.11.5\nfix xy is ongeldig: #289 #295\nverwijder Sentry",
        "fr": "ajouter une nouvelle tentative si la passerelle est occupée\nchanger la plage min/max pour le décalage\ntraductions mises à jour\nlien fixe pour la page de présentation\nle paramètre fix ne peut pas être défini depuis deConz 2.11.5\ncorriger xy n'est pas valide : #289 #295\nsupprimer sentinelle",
        "it": "aggiungi riprova se il gateway è occupato\nmodificare l'intervallo min/max per l'offset\ntraduzioni aggiornate\ncollegamento di correzione per la pagina di panoramica\nfix parametro non può essere impostato da deConz 2.11.5\nfix xy non è valido: #289 #295\nrimuovi Sentinella",
        "es": "agregar reintento si la puerta de enlace está ocupada\ncambiar el rango mínimo/máximo para la compensación\ntraducciones actualizadas\narreglar el enlace para la página de resumen\nEl parámetro fijo no se puede configurar desde deConz 2.11.5\narreglar xy no es válido: #289 #295\nquitar centinela",
        "pl": "dodaj spróbuj ponownie, jeśli bramka jest zajęta\nzmień zakres min/maks dla przesunięcia\nzaktualizowane tłumaczenia\nnapraw link do strony przeglądu\nnie można ustawić parametru fix od czasu deConz 2.11.5\nnaprawienie xy jest nieprawidłowe: #289 #295\nusuń Sentry",
        "zh-cn": "如果网关忙，则添加重试\n更改偏移的最小/最大范围\n更新的翻译\n修复概览页面的链接\n自 deConz 2.11.5 以来无法设置修复参数\n修复 xy 无效：#289 #295\n移除哨兵"
      },
      "1.3.19": {
        "en": "fix for js-controller 3.3.x",
        "de": "Fix für js-Controller 3.3.x",
        "ru": "исправление для js-controller 3.3.x",
        "pt": "correção para js-controller 3.3.x",
        "nl": "fix voor js-controller 3.3.x",
        "fr": "correctif pour js-controller 3.3.x",
        "it": "correzione per js-controller 3.3.x",
        "es": "arreglo para js-controller 3.3.x",
        "pl": "poprawka dla kontrolera js 3.3.x",
        "zh-cn": "修复 js 控制器 3.3.x"
      },
      "1.3.18": {
        "en": "fix crash [#248](https://github.com/Jey-Cee/ioBroker.deconz/issues/248)"
      },
      "1.3.16": {
        "en": "added datapoints melody and volume (Used by NEO-Alarm-Sirene by Tuya)\nadded new effects for Müller Licht Tint: sunset, party, worklight, campfire, romance, nightlight\nadded new effects for Lidl Melinera: steady, snow, rainbow, snake, twinkle, fireworks, flag, waves, updown, vintage, fading, collide, strobe, sparkles, carnival, glow\nadded 2 new datapoints they were used by Lidl Melinera effects: effectspeed: simple number; effectcolours: array of rgb values = [[255,0,0],[0,255,0],[0,0,255]]",
        "de": "Datenpunkte melody und volume hinzugefügt (verwendet von NEO-Alarm-Sirene von Tuya)\nneue Effekte für Müller Licht Tint hinzugefügt: Sonnenuntergang, Party, Arbeitslicht, Lagerfeuer, Romantik, Nachtlicht\nneue Effekte für Lidl Melinera hinzugefügt: Steady, Snow, Rainbow, Snake, Twinkle, Fireworks, Flag, Waves, Updown, Vintage, Fading, Collide, Strobe, Sparkles, Carnival, Glow\n2 neue Datenpunkte hinzugefügt, die von Lidl verwendet wurden Melinera-Effekte: effectspeed: einfache Zahl; Effektfarben: Array von RGB-Werten = [[255,0,0],[0,255,0],[0,0,255]]",
        "ru": "добавлены мелодия и громкость точек данных (используется в NEO-Alarm-Sirene от Tuya)\nдобавлены новые эффекты для Müller Licht Tint: закат, вечеринка, рабочий свет, костер, романтика, ночник.\nдобавлены новые эффекты для Lidl Melinera: устойчивый, снег, радуга, змея, мерцание, фейерверк, флаг, волны, апгрейд, винтаж, затухание, столкновение, стробоскоп, блестки, карнавал, свечение\nдобавлены 2 новые точки данных, которые использовались Lidl Melinera. Эффекты: effectspeed: simple number; effectcolours: массив значений RGB = [[255,0,0], [0,255,0], [0,0,255]]",
        "pt": "adicionado pontos de dados melodia e volume (usado por NEO-Alarm-Sirene por Tuya)\nadicionou novos efeitos para Müller Licht Tint: pôr do sol, festa, luz de trabalho, fogueira, romance, luz noturna\nadicionou novos efeitos para Lidl Melinera: constante, neve, arco-íris, cobra, cintilação, fogos de artifício, bandeira, ondas, ascendente, vintage, desbotamento, colisão, estroboscópio, brilhos, carnaval, brilho\nadicionou 2 novos pontos de dados que foram usados pelos efeitos do Lidl Melinera: velocidade de efeitos: número simples; effectcolours: matriz de valores rgb = [[255,0,0], [0,255,0], [0,0,255]]",
        "nl": "toegevoegde melodie en volume datapunten (Gebruikt door NEO-Alarm-Sirene door Tuya)\nnieuwe effecten toegevoegd voor Müller Licht Tint: zonsondergang, feest, werklicht, kampvuur, romantiek, nachtlampje\nnieuwe effecten toegevoegd voor Lidl Melinera: stabiel, sneeuw, regenboog, slang, twinkeling, vuurwerk, vlag, golven, updown, vintage, vervagen, botsen, stroboscoop, glitters, carnaval, gloed\n2 nieuwe datapunten toegevoegd die werden gebruikt door Lidl Melinera-effecten: effectspeed: eenvoudig nummer; effectkleuren: array van rgb-waarden = [[255,0,0],[0,255,0],[0,0,255]]",
        "fr": "mélodie et volume des points de données ajoutés (utilisé par NEO-Alarm-Sirene par Tuya)\najout de nouveaux effets pour Müller Licht Tint : coucher de soleil, fête, lampe de travail, feu de camp, romance, veilleuse\najout de nouveaux effets pour Lidl Melinera : stable, neige, arc-en-ciel, serpent, scintillement, feux d'artifice, drapeau, vagues, haut vers le bas, vintage, décoloration, collision, stroboscope, étincelles, carnaval, lueur\najouté 2 nouveaux points de données ils ont été utilisés par Lidl Melinera effets : effectspeed : nombre simple ; couleurs d'effet : tableau de valeurs RVB = [[255,0,0],[0,255,0],[0,0,255]]",
        "it": "melodia e volume dei punti dati aggiunti (utilizzato da NEO-Alarm-Sirene di Tuya)\naggiunti nuovi effetti per Müller Licht Tint: tramonto, festa, luce di lavoro, falò, romanticismo, luce notturna night\naggiunti nuovi effetti per Lidl Melinera: costante, neve, arcobaleno, serpente, scintillio, fuochi d'artificio, bandiera, onde, updown, vintage, dissolvenza, collisione, strobo, scintillii, carnevale, bagliore\naggiunti 2 nuovi datapoint sono stati usati da Lidl Melinera effects: effectspeed: simple number; effectcolors: array di valori RGB = [[255,0,0],[0,255,0],[0,0,255]]",
        "es": "puntos de datos añadidos melodía y volumen (utilizado por NEO-Alarm-Sirene por Tuya)\nSe agregaron nuevos efectos para Müller Licht Tint: puesta de sol, fiesta, luz de trabajo, fogata, romance, luz nocturna.\nSe agregaron nuevos efectos para Lidl Melinera: constante, nieve, arco iris, serpiente, centelleo, fuegos artificiales, bandera, olas, arriba abajo, vintage, desvanecimiento, colisión, luz estroboscópica, destellos, carnaval, resplandor.\nse agregaron 2 nuevos puntos de datos que fueron utilizados por Lidl Melinera. efectos: velocidad de efectos: número simple; colores de efecto: matriz de valores rgb = [[255,0,0], [0,255,0], [0,0,255]]",
        "pl": "dodano melodię i głośność punktów danych (używane przez NEO-Alarm-Sirene przez Tuya)\ndodano nowe efekty dla Müller Licht Tint: zachód słońca, impreza, światło robocze, ognisko, romans, światło nocne\ndodano nowe efekty dla Lidla Melinera: stały, śnieg, tęcza, wąż, migotanie, fajerwerki, flaga, fale, updown, vintage, blaknięcie, zderzenie, stroboskop, błyszczy, karnawał, blask\ndodano 2 nowe punkty danych, z których korzystały efekty Lidla Melinera: effectspeed: prosta liczba; kolory efektów: tablica wartości rgb = [[255,0,0],[0,255,0],[0,0,255]]",
        "zh-cn": "添加数据点旋律和音量（由图雅的 NEO-Alarm-Sirene 使用）\n为 Müller Licht Tint 添加了新效果：日落、派对、工作灯、篝火、浪漫、夜光\n为 Lidl Melinera 添加了新效果：稳定、雪花、彩虹、蛇、闪烁、烟花、旗帜、波浪、颠倒、复古、褪色、碰撞、频闪、火花、狂欢、发光\n添加了 Lidl Melinera 效果使用的 2 个新数据点： effectspeed：简单数字；效果颜色：rgb 值数组 = [[255,0,0],[0,255,0],[0,0,255]]"
      },
      "1.3.15": {
        "en": "fix info message: \"State value to set for \"deconz.0.Sensors.3.pending\" has to be stringified but received type \"object\"\"\nfix info message: State value to set for \"deconz.0.Sensors.3.orientation\" has to be stringified but received type \"object\"",
        "de": "Info-Meldung korrigieren: \"Der für\" deconz.0.Sensors.3.pending \"festzulegende Statuswert muss stringifiziert werden, muss jedoch vom Typ\" object \"empfangen werden.\"\nInfo-Nachricht korrigieren: Der für \"deconz.0.Sensors.3.orientation\" zu setzende Statuswert muss stringifiziert werden, aber vom Typ \"object\" erhalten",
        "ru": "исправить информационное сообщение: \"Значение состояния, которое нужно установить для\" deconz.0.Sensors.3.pending \", должно быть преобразовано в строку, но получен тип\" объект \"\"\nисправление информационного сообщения: значение состояния, устанавливаемое для \"deconz.0.Sensors.3.orientation\", должно быть преобразовано в строку, но получен тип \"объект\"",
        "pt": "mensagem de informação de correção: \"Valor de estado a ser definido para\" deconz.0.Sensors.3.pending \"deve ser transformado em string, mas recebeu o tipo\" objeto \"\"\nmensagem de informação de correção: o valor do estado a ser definido para \"deconz.0.Sensors.3.orientation\" deve ser transformado em string, mas recebeu o tipo \"objeto\"",
        "nl": "fix info message: \"State value to set for\" deconz.0.Sensors.3.pending \"moet stringified maar ontvangen type\" object \"\"\nfix info message: State value to set for \"deconz.0.Sensors.3.orientation\" moet stringified maar ontvangen type \"object\"",
        "fr": "Correction du message d'information: \"La valeur de l'état à définir pour\" deconz.0.Sensors.3.pending \"doit être stringifiée mais le type reçu\" object \"\"\ncorrection du message d'information: la valeur d'état à définir pour \"deconz.0.Sensors.3.orientation\" doit être stringifiée mais le type reçu \"object\"",
        "it": "messaggio informativo risolto: \"Il valore dello stato da impostare per\" deconz.0.Sensors.3.pending \"deve essere stringificato ma ricevuto il tipo\" oggetto \"\"\nmessaggio informativo risolto: il valore di stato da impostare per \"deconz.0.Sensors.3.orientation\" deve essere stringificato ma ricevuto il tipo \"oggetto\"",
        "es": "Corregir mensaje de información: \"El valor de estado para establecer para\" deconz.0.Sensors.3.pending \"tiene que estar en cadena pero se recibió el tipo\" objeto \"\"\nmensaje de información de corrección: el valor de estado para establecer para \"deconz.0.Sensors.3.orientation\" tiene que estar en cadena pero se recibió el tipo \"objeto\"",
        "pl": "komunikat informacyjny o naprawie: \"Wartość stanu do ustawienia dla\" deconz.0.Sensors.3.pending \"musi zostać zdefiniowana, ale otrzymano typ\" object \"\"\nkomunikat informacyjny naprawy: Wartość stanu do ustawienia dla „deconz.0.Sensors.3.orientation” musi zostać określona, ale otrzymano typ „object”",
        "zh-cn": "修复信息消息：“必须为“ deconz.0.Sensors.3.pending”设置的状态值必须被字符串化，但是接收到的类型为“ object”\n修复信息消息：必须将为“ deconz.0.Sensors.3.orientation”设置的状态值进行字符串化，但接收到的类型为“对象”"
      },
      "1.3.14": {
        "en": "fixes for js-controller 3.3"
      }
    },
    "title": "deConz ZigBee",
    "titleLang": {
      "en": "deConz ZigBee",
      "de": "deConz ZigBee",
      "ru": "deConz ZigBee",
      "pt": "deConz ZigBee",
      "nl": "deConz ZigBee",
      "fr": "deConz ZigBee",
      "it": "deConz ZigBee",
      "es": "deConz ZigBee",
      "pl": "deConz ZigBee"
    },
    "desc": {
      "en": "Connects to the deConz Software that is an gateway solution for ZigBee. deConz works with ConBee USB stick and RaspBee modul for Raspberry Pi which is also from Dresden-Elektronik.",
      "de": "Verbindet sich mit der deConz-Software, die eine Gateway-Lösung für ZigBee ist. deConz arbeitet mit dem ConBee USB Stick und dem RaspBee Modul für den Raspberry Pi, die ebenfalls von Dresden-Elektronik sind.",
      "ru": "Подключается к программному обеспечению deConz, которое является шлюзовым решением для ZigBee. deConz работает с ConBee и RaspBee, который также из Дрездена-Электроника.",
      "pt": "Conecta ao software deConz que é uma solução de gateway para o ZigBee. DeConz trabalha com o conwee USB stick e RaspBee modul para Raspberry Pi que também é de Dresden-Elektronik.",
      "nl": "Maakt verbinding met de deConz-software die een gateway-oplossing is voor ZigBee. deConz werkt met ConBee USB-stick en RaspBee-module voor Raspberry Pi, die ook van Dresden-Elektronik is.",
      "fr": "Se connecte au logiciel deConz qui est une solution de passerelle pour ZigBee. deConz fonctionne avec la clé USB ConBee et le module RaspBee pour Raspberry Pi, également de Dresden-Elektronik.",
      "it": "Si collega al software deConz che è una soluzione gateway per ZigBee. deConz funziona con ConBee USB stick e RaspBee modul per Raspberry Pi, anch'esso di Dresden-Elektronik.",
      "es": "Se conecta al software deConz que es una solución de puerta de enlace para ZigBee. deConz funciona con el dispositivo USB ConBee y el módulo RaspBee para Raspberry Pi, que también es de Dresden-Elektronik.",
      "pl": "Łączy się z oprogramowaniem deConz, które jest rozwiązaniem bramkowym dla ZigBee. deConz współpracuje z pamięcią USB ConBee i modułem RaspBee dla Raspberry Pi, który jest również z firmy Dresden-Elektronik."
    },
    "authors": [
      "Jey Cee <jey-cee@live.com>"
    ],
    "license": "Apache-2.0",
    "platform": "Javascript/Node.js",
    "mode": "daemon",
    "connectionType": "local",
    "dataSource": "push",
    "localLink": "http://%bridge%:%port%",
    "compact": true,
    "messagebox": true,
    "enabled": true,
    "plugins": {},
    "dependencies": [
      {
        "js-controller": ">=2.0.0"
      }
    ],
    "readme": "https://github.com/Jey-Cee/ioBroker.deconz/blob/master/README.md",
    "loglevel": "info",
    "keywords": [
      "deconz",
      "philips",
      "tradfri",
      "lightify",
      "dresden-elektronik",
      "hue",
      "led",
      "rgb",
      "smartlink",
      "zigbee"
    ],
    "icon": "deconz.png",
    "materialize": true,
    "extIcon": "https://raw.githubusercontent.com/Jey-Cee/ioBroker.deconz/master/admin/deconz.png",
    "type": "hardware"
  },
  "native": {
    "sentry": true
  },
  "instanceObjects": [
    {
      "_id": "Groups",
      "type": "channel",
      "common": {
        "name": "Information"
      },
      "native": {}
    },
    {
      "_id": "Lights",
      "type": "channel",
      "common": {
        "name": "Information"
      },
      "native": {}
    },
    {
      "_id": "Sensors",
      "type": "channel",
      "common": {
        "name": "Information"
      },
      "native": {}
    },
    {
      "_id": "info",
      "type": "device",
      "common": {
        "name": "Information for adapter"
      },
      "native": {}
    },
    {
      "_id": "info.connection",
      "type": "state",
      "common": {
        "name": "Connection to deConz",
        "type": "boolean",
        "role": "indicator",
        "def": false
      },
      "native": {}
    },
    {
      "_id": "Gateway_info",
      "type": "device",
      "common": {
        "name": "Information about the Gateway"
      },
      "native": {}
    },
    {
      "_id": "Gateway_info.network_open",
      "type": "state",
      "common": {
        "name": "Open Network for new Zigbee devices",
        "type": "boolean",
        "role": "indicator",
        "read": true,
        "write": true,
        "def": false
      },
      "native": {}
    },
    {
      "_id": "Gateway_info.alive",
      "type": "state",
      "common": {
        "name": "Gateway alive",
        "type": "boolean",
        "role": "indicator.online",
        "read": true,
        "write": false,
        "def": false
      },
      "native": {}
    }
  ],
  "objects": [
    {
      "_id": "enum.functions.color",
      "common": {
        "name": "Color",
        "members": []
      },
      "type": "enum",
      "native": {}
    }
  ]
}
