{
    "common": {
        "name": "deconz",
        "version": "0.4.0",
        "news": {
            "0.2.2": {
                "en": "Changed id naming \n Use websocket messages instead polling afterwards",
                "de": "Geänderte ID-Benennung \n Verwenden von Websocket-Nachrichten, anstelle von polling",
                "ru": "Изменено имя именования имен \n Использовать сообщения websocket вместо опроса потом",
                "pt": "Nomenclatura de ID alterada \n Use mensagens de websocket em vez de pesquisar depois",
                "nl": "Namen van id's gewijzigd \n Gebruik websocket-berichten in plaats daarvan navraag achteraf",
                "fr": "Modification de l'identifiant de l'identifiant \n Utilisation des messages websocket à la place de l'interrogation ultérieure",
                "it": "Nome id cambiato \n Usa i messaggi websocket, poi esegui il polling in seguito",
                "es": "Se cambió el nombre de la identificación \n Use los mensajes de websocket en lugar de sondear después",
                "pl": "Zmieniono nazewnictwo nazw \n Użyj zamiast tego komunikatów websocket zamiast odpytywania"
            },
            "0.2.1": {
                "en": "Added new elements to config; Changed some small things",
                "de": "Neue Elemente zur Konfiguration hinzugefügt; Einige kleine Dinge geändert",
                "ru": "Добавлены новые элементы в config; Изменены некоторые мелочи",
                "pt": "Adicionado novos elementos à configuração; Mudou algumas pequenas coisas",
                "nl": "Nieuwe elementen toegevoegd aan config; Een paar kleine dingen veranderd",
                "fr": "Ajout de nouveaux éléments à config; Changé quelques petites choses",
                "it": "Aggiunti nuovi elementi alla configurazione; Cambiato alcune piccole cose",
                "es": "Se agregaron nuevos elementos a config; Cambió algunas cosas pequeñas",
                "pl": "Dodano nowe elementy do konfiguracji; Zmieniono kilka małych rzeczy"
            },
            "0.2.0": {
                "en": "next Try with Xiaomi Sensors; Added \"pressure\" sensor; Added create group to adapter config;",
                "de": "nächster Versuch mit Xiaomi Sensoren; Hinzugefügt \"Druck\" -Sensor; Gruppe zu Adapterkonfiguration hinzugefügt hinzugefügt;",
                "ru": "следующее Попробуйте с датчиками Xiaomi; Добавлен датчик давления; Добавлена ​​возможность создания группы в конфигурацию адаптера;",
                "pt": "next Experimente com o Xiaomi Sensors; Adicionado sensor de \"pressão\"; Adicionado criar grupo para configuração do adaptador;",
                "nl": "volgende Probeer met Xiaomi-sensoren; Toegevoegd \"druk\" sensor; Groep toevoegen aan adapterconfiguratie toegevoegd;",
                "fr": "suivant Essayez avec Xiaomi Sensors; Ajout d'un capteur \"pression\" Ajout du groupe de création à la configuration de l'adaptateur;",
                "it": "avanti Prova con Xiaomi Sensors; Aggiunto sensore \"pressione\"; Aggiunto creare un gruppo per la configurazione dell'adattatore;",
                "es": "Siguiente Prueba con Xiaomi Sensors; Sensor de \"presión\" agregado; Se agregó crear grupo a la configuración del adaptador;",
                "pl": "dalej Wypróbuj Xiaomi Sensors; Dodano czujnik \"ciśnienia\"; Dodano tworzenie grupy do konfiguracji adaptera;"
            },
            "0.1.7": {
                "en": "add possibility to delete devices from deConz; fix issue on getAll... functions when there are is nothing;",
                "de": "Möglichkeit hinzufügen, Geräte von deConz zu löschen; Problem beheben bei getAll ... Funktionen, wenn es nichts gibt;",
                "ru": "добавить возможность удаления устройств из deConz; исправить проблему на getAll ... функции, когда есть ничего;",
                "pt": "adicionar possibilidade de excluir dispositivos de deConz; corrigir problema em funções getAll ... quando não há nada;",
                "nl": "mogelijkheid toevoegen om apparaten van deConz te verwijderen; probleem oplossen op getAll ... functies wanneer er niets is;",
                "fr": "ajouter la possibilité de supprimer des périphériques de deConz; résoudre le problème sur getAll ... fonctions quand il n'y a rien;",
                "it": "aggiungere la possibilità di eliminare i dispositivi da DeConz; risolvere il problema su getAll ... funzioni quando non ci sono nulla;",
                "es": "agregar la posibilidad de eliminar dispositivos de deConz; soluciona el problema en las funciones getAll ... cuando no hay nada;",
                "pl": "dodaj możliwość usunięcia urządzeń z deConz; Napraw problem na getAll ... funkcje, gdy nie ma nic;"
            },
            "0.1.6": {
                "en": "fix Xiaomi Sensor recognition",
                "de": "Xiaomi Sensorerkennung beheben",
                "ru": "исправить распознавание датчика Xiaomi",
                "pt": "conserte o reconhecimento do sensor Xiaomi",
                "nl": "fix Xiaomi sensorherkenning",
                "fr": "Correction de la reconnaissance du capteur Xiaomi",
                "it": "correggere il riconoscimento del sensore Xiaomi",
                "es": "arreglar el reconocimiento del sensor Xiaomi",
                "pl": "naprawić rozpoznawanie czujnika Xiaomi"
            },
            "0.1.5": {
                "en": "Try to fix Sensors",
                "de": "Versuchen Sie, Sensoren zu reparieren",
                "ru": "Попробуйте исправить датчики",
                "pt": "Tente corrigir os sensores",
                "nl": "Probeer sensoren te repareren",
                "fr": "Essayez de réparer les capteurs",
                "it": "Prova a sistemare i sensori",
                "es": "Intenta reparar los sensores",
                "pl": "Spróbuj naprawić czujniki"
            },
            "0.1.4": {
                "en": "Added support for Admin v3",
                "de": "Unterstützung für Admin v3 hinzugefügt",
                "ru": "Добавлена ​​поддержка Admin v3",
                "pt": "Adicionado suporte para Admin v3",
                "nl": "Ondersteuning toegevoegd voor Admin v3",
                "fr": "Ajout du support pour Admin v3",
                "it": "Aggiunto supporto per Admin v3",
                "es": "Se agregó soporte para Admin v3",
                "pl": "Dodano obsługę administratora v3"
            },
            "0.1.3": {
                "en": "Stop Spam in log; Added filter for name to id conversation",
                "de": "Stoppen Sie Spam im Protokoll; Filter für Name zu ID-Konversation hinzugefügt",
                "ru": "Остановить спам в журнале; Добавлен фильтр для диалога id в id",
                "pt": "Pare Spam no log; Filtro adicionado para o nome para id conversação",
                "nl": "Stop Spam in het logboek; Filter toegevoegd voor naam- en id-conversatie",
                "fr": "Arrêter le spam dans le journal; Filtre ajouté pour le nom à la conversation d'identification",
                "it": "Interrompi spam nel registro; Aggiunto filtro per il nome alla conversazione id",
                "es": "Detener el spam en el registro; Filtro agregado para el nombre de la conversación de id.",
                "pl": "Zatrzymaj spam w dzienniku; Dodano filtr do konwersacji nazw do ID"
            },
            "0.1.2": {
                "en": "Added new datapoints for sensors (experimental)",
                "de": "Neue Datenpunkte für Sensoren hinzugefügt (Experimentell)",
                "ru": "Добавлены новые точки данных для датчиков (Experimental)"
            },
            "0.1.1": {
                "en": "Complete adapter rewritten",
                "de": "Adapter Vollständig neu geschrieben",
                "ru": "Полный адаптер переписан"
            },
            "0.1.0": {
                "en": "alpha version",
                "de": "alpha version",
                "ru": "альфа-версия"
            },
            "0.2.3": {
                "en": "Create objects during runing adapter;",
                "de": "",
                "ru": "",
                "pt": "",
                "nl": "",
                "fr": "",
                "it": "",
                "es": "",
                "pl": ""
            },
            "0.2.4": {
                "en": "Fix create objects during running adapter;",
                "de": "",
                "ru": "",
                "pt": "",
                "nl": "",
                "fr": "",
                "it": "",
                "es": "",
                "pl": ""
            },
            "0.2.5": {
                "en": "Fix/Change handling create objects during running Adapter",
                "de": "",
                "ru": "",
                "pt": "",
                "nl": "",
                "fr": "",
                "it": "",
                "es": "",
                "pl": ""
            },
            "0.3.0": {
                "en": "Added scene support Drop nodejs 4 support\n",
                "de": "Szenenunterstützung hinzugefügt \n",
                "ru": "Добавлена ​​поддержка сцены \n",
                "pt": "Adicionado suporte de cena \n",
                "nl": "Ondersteuning van scènes toegevoegd \n",
                "fr": "Ajout du support de scène \n",
                "it": "Aggiunto supporto alla scena \n",
                "es": "Añadido soporte de escena \n",
                "pl": "Dodano obsługę scen \n"
            },
            "0.3.1": {
                "en": "Fixing hue from range 0-65535 to 0-360\n",
                "de": "Farbton im Bereich von 0-65535 bis 0-360\n",
                "ru": "Фиксация оттенка в диапазоне от 0-65535 до 0-360\n",
                "pt": "Correção de matiz do intervalo 0-65535 a 0-360\n",
                "nl": "Tint vastzetten van bereik 0-65535 tot 0-360\n",
                "fr": "Teinte de fixation comprise entre 0-65535 et 0-360\n",
                "it": "Fixing hue nell'intervallo 0-65535 a 0-360\n",
                "es": "Tono de fijación desde el rango 0-65535 a 0-360\n",
                "pl": "Naprawianie barwy od zakresu 0-65535 do 0-360\n"
            },
            {
            "0.4.0": {
                "en": "Fix for hue change; Added support for dimming lights and groups; Added support for custom actions;",
                "de": "Fix für Farbtonänderung; Unterstützung für das Dimmen von Licht und Gruppen hinzugefügt; Unterstützung für benutzerdefinierte Aktionen hinzugefügt;",
                "ru": "Исправлена ​​смена оттенка; Добавлена ​​поддержка диммирования огней и групп; Добавлена ​​поддержка пользовательских действий;",
                "pt": "Correção para alteração de matiz; Adicionado suporte para escurecimento de luzes e grupos; Adicionado suporte para ações personalizadas;",
                "nl": "Oplossing voor tintverandering; Ondersteuning toegevoegd voor het dimmen van lichten en groepen; Ondersteuning voor aangepaste acties toegevoegd;",
                "fr" : "Correction du changement de teinte; Ajout du support pour atténuer les lumières et les groupes; Ajout du support pour les actions personnalisées;",
                "it": "Correzione per il cambiamento di tonalità; Aggiunto supporto per luci soffuse e gruppi; Aggiunto supporto per azioni personalizzate;",
                "es": "Corrección para el cambio de tono; Añadido soporte para atenuar luces y grupos; Añadido soporte para acciones personalizadas;",
                "pl": "Napraw dla zmiany barwy; Dodano obsługę ściemniania świateł i grup; Dodano obsługę niestandardowych działań;",
                "zh-cn": "修复色调变化;增加了对调光灯和组的支持;添加了对自定义操作的支持"
                }
            }
        },
        "title": "deConz ZigBee",
        "titleLang": {
            "en": "deConz ZigBee",
            "de": "deConz ZigBee",
            "ru": "deConz ZigBee",
            "pt": "deConz ZigBee",
            "nl": "deConz ZigBee",
            "fr": "deConz ZigBee",
            "it": "deConz ZigBee",
            "es": "deConz ZigBee",
            "pl": "deConz ZigBee"
        },
        "desc": {
            "en": "Connects to the deConz Software that is an gateway solution for ZigBee. deConz works with ConBee USB stick and RaspBee modul for Raspberry Pi which is also from Dresden-Elektronik.",
            "de": "Verbindet sich mit der deConz-Software, die eine Gateway-Lösung für ZigBee ist. deConz arbeitet mit dem ConBee USB Stick und dem RaspBee Modul für den Raspberry Pi, die ebenfalls von Dresden-Elektronik sind.",
            "ru": "Подключается к программному обеспечению deConz, которое является шлюзовым решением для ZigBee. deConz работает с ConBee и RaspBee, который также из Дрездена-Электроника.",
            "pt": "Conecta ao software deConz que é uma solução de gateway para o ZigBee. DeConz trabalha com o conwee USB stick e RaspBee modul para Raspberry Pi que também é de Dresden-Elektronik.",
            "nl": "Maakt verbinding met de deConz-software die een gateway-oplossing is voor ZigBee. deConz werkt met ConBee USB-stick en RaspBee-module voor Raspberry Pi, die ook van Dresden-Elektronik is.",
            "fr": "Se connecte au logiciel deConz qui est une solution de passerelle pour ZigBee. deConz fonctionne avec la clé USB ConBee et le module RaspBee pour Raspberry Pi, également de Dresden-Elektronik.",
            "it": "Si collega al software deConz che è una soluzione gateway per ZigBee. deConz funziona con ConBee USB stick e RaspBee modul per Raspberry Pi, anch'esso di Dresden-Elektronik.",
            "es": "Se conecta al software deConz que es una solución de puerta de enlace para ZigBee. deConz funciona con el dispositivo USB ConBee y el módulo RaspBee para Raspberry Pi, que también es de Dresden-Elektronik.",
            "pl": "Łączy się z oprogramowaniem deConz, które jest rozwiązaniem bramkowym dla ZigBee. deConz współpracuje z pamięcią USB ConBee i modułem RaspBee dla Raspberry Pi, który jest również z firmy Dresden-Elektronik."
        },
        "authors": [
            "Jey Cee <jey-cee@live.com>"
        ],
        "license": "Apache 2.0",
        "platform": "Javascript/Node.js",
        "mode": "daemon",
        "messagebox": true,
        "enabled": true,
        "readme": "https://github.com/iobroker-community-adapters/ioBroker.deconz/blob/master/README.md",
        "loglevel": "info",
        "keywords": [
            "deconz",
            "philips",
            "tradfri",
            "lightify",
            "dresden-elektronik",
            "hue",
            "led",
            "rgb",
            "smartlink",
            "zigbee"
        ],
        "icon": "deconz.png",
        "materialize": true,
        "extIcon": "https://raw.githubusercontent.com/iobroker-community-adapters/ioBroker.deconz/master/admin/deconz.png",
        "type": "hardware"
    },
    "native": {
        "bridge": "0.0.0.0",
        "port": 8080,
        "user": "",
        "polling": true,
        "pollingInterval": 30,
        "openNetwork": false,
        "websocketport": 443,
        "sw_version": "",
        "channel": "",
        "api_version": "",
        "permit": "60"
    },
    "objects": [
        {
            "_id": "enum.functions.color",
            "common": {
                "name": "Color",
                "members": []
            },
            "type": "enum",
            "native": {}
        }
    ]
}
